Ran Plan for dir: `infrastructure/live/dev/s3` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terraform show -json $PLANFILE > $SHOWFILE' in '/home/atlantis/.atlantis/repos/gmk1995/terragrunt-openinfraquote-atlantis/1/default/infrastructure/live/dev/s3': exit status 1: running "terraform show -json $PLANFILE > $SHOWFILE" in "/home/atlantis/.atlantis/repos/gmk1995/terragrunt-openinfraquote-atlantis/1/default/infrastructure/live/dev/s3": 
╷
│ Error: Couldn't show local plan
│ 
│ Plan read error: plan file was created by Terraform 1.11.4, but this is
│ 1.14.3; plan files cannot be transferred between different Terraform
│ versions
╵

12:35:05.294 INFO   tofu: Initializing the backend...
12:35:12.401 INFO   tofu: Initializing provider plugins...
12:35:12.402 INFO   tofu: - Reusing previous version of hashicorp/aws from the dependency lock file
12:35:18.248 INFO   tofu: - Using previously-installed hashicorp/aws v6.33.0
12:35:18.248 INFO   tofu: OpenTofu has been successfully initialized!
12:35:32.164 STDOUT tofu: data.aws_partition.current: Reading...
12:35:32.173 STDOUT tofu: data.aws_region.current: Reading...
12:35:32.173 STDOUT tofu: data.aws_caller_identity.current: Reading...
12:35:32.173 STDOUT tofu: aws_s3_bucket.this[0]: Refreshing state... [id=skillupaws-dev-app-bucket]
12:35:32.174 STDOUT tofu: data.aws_region.current: Read complete after 0s [id=ap-south-2]
12:35:32.174 STDOUT tofu: data.aws_partition.current: Read complete after 0s [id=aws]
12:35:32.174 STDOUT tofu: data.aws_caller_identity.current: Read complete after 0s [id=604842892493]
12:35:32.494 STDOUT tofu: aws_s3_bucket_versioning.this[0]: Refreshing state... [id=skillupaws-dev-app-bucket]
12:35:32.495 STDOUT tofu: aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=skillupaws-dev-app-bucket]
12:35:32.495 STDOUT tofu: aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=skillupaws-dev-app-bucket]
12:35:33.988 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
12:35:33.988 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
12:35:33.990 STDOUT tofu: -/+ destroy and then create replacement
12:35:33.990 STDOUT tofu: OpenTofu will perform the following actions:
12:35:33.990 STDOUT tofu:   # aws_s3_bucket.this[0] must be replaced
12:35:33.990 STDOUT tofu: -/+ resource "aws_s3_bucket" "this" {
12:35:33.990 STDOUT tofu:       + acceleration_status         = (known after apply)
12:35:33.990 STDOUT tofu:       + acl                         = (known after apply)
12:35:33.990 STDOUT tofu:       ~ arn                         = "arn:aws:s3:::skillupaws-dev-app-bucket" -> (known after apply)
12:35:33.990 STDOUT tofu:       ~ bucket                      = "skillupaws-dev-app-bucket" -> "skillupaws-dev-app-bucket-01" # forces replacement
12:35:33.990 STDOUT tofu:       ~ bucket_domain_name          = "skillupaws-dev-app-bucket.s3.amazonaws.com" -> (known after apply)
12:35:33.990 STDOUT tofu:       + bucket_prefix               = (known after apply)
12:35:33.990 STDOUT tofu:       ~ bucket_region               = "ap-south-2" -> (known after apply)
12:35:33.990 STDOUT tofu:       ~ bucket_regional_domain_name = "skillupaws-dev-app-bucket.s3.ap-south-2.amazonaws.com" -> (known after apply)
12:35:33.991 STDOUT tofu:       ~ hosted_zone_id              = "Z02976202B4EZMXIPMXF7" -> (known after apply)
12:35:33.991 STDOUT tofu:       ~ id                          = "skillupaws-dev-app-bucket" -> (known after apply)
12:35:33.991 STDOUT tofu:       + policy                      = (known after apply)
12:35:33.991 STDOUT tofu:       ~ request_payer               = "BucketOwner" -> (known after apply)
12:35:33.991 STDOUT tofu:       - tags                        = {} -> null
12:35:33.991 STDOUT tofu:       + website_domain              = (known after apply)
12:35:33.991 STDOUT tofu:       + website_endpoint            = (known after apply)
12:35:33.991 STDOUT tofu:         # (4 unchanged attributes hidden)
12:35:33.991 STDOUT tofu:       ~ cors_rule {
12:35:33.991 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.991 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.991 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.991 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.991 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.991 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.991 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.991 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.991 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.991 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.991 STDOUT tofu:           + id                          = (known after apply)
12:35:33.991 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.991 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.991 STDOUT tofu:           + region                      = (known after apply)
12:35:33.991 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.991 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.991 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.991 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.991 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.991 STDOUT tofu:         } -> (known after apply)
12:35:33.991 STDOUT tofu:       ~ grant {
12:35:33.991 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.992 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.992 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.992 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.992 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.992 STDOUT tofu:           + id                          = (known after apply)
12:35:33.992 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.992 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.992 STDOUT tofu:           + region                      = (known after apply)
12:35:33.992 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.992 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.992 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.992 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.992 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.992 STDOUT tofu:         } -> (known after apply)
12:35:33.992 STDOUT tofu:       ~ lifecycle_rule {
12:35:33.992 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.992 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.992 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.992 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.992 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.992 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.992 STDOUT tofu:           + id                          = (known after apply)
12:35:33.992 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.992 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.992 STDOUT tofu:           + region                      = (known after apply)
12:35:33.992 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.993 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.993 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.993 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.993 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.993 STDOUT tofu:         } -> (known after apply)
12:35:33.993 STDOUT tofu:       ~ logging {
12:35:33.993 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.993 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.993 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.993 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.993 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.993 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.993 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.993 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.993 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.993 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.993 STDOUT tofu:           + id                          = (known after apply)
12:35:33.993 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.993 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.993 STDOUT tofu:           + region                      = (known after apply)
12:35:33.993 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.993 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.993 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.993 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.993 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.993 STDOUT tofu:         } -> (known after apply)
12:35:33.993 STDOUT tofu:       ~ object_lock_configuration {
12:35:33.993 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.993 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.994 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.994 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.994 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.994 STDOUT tofu:           + id                          = (known after apply)
12:35:33.994 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.994 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.994 STDOUT tofu:           + region                      = (known after apply)
12:35:33.994 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.994 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.994 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.994 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.994 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.994 STDOUT tofu:         } -> (known after apply)
12:35:33.994 STDOUT tofu:       ~ replication_configuration {
12:35:33.994 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.994 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.994 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.994 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.994 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.994 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.994 STDOUT tofu:           + id                          = (known after apply)
12:35:33.994 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.994 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.995 STDOUT tofu:           + region                      = (known after apply)
12:35:33.995 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.995 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.995 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.995 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.995 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.995 STDOUT tofu:         } -> (known after apply)
12:35:33.995 STDOUT tofu:       ~ server_side_encryption_configuration {
12:35:33.995 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.995 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.995 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.995 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.995 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.995 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.995 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.995 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.995 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.995 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.995 STDOUT tofu:           + id                          = (known after apply)
12:35:33.995 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.996 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.996 STDOUT tofu:           + region                      = (known after apply)
12:35:33.996 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.996 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.996 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.996 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.996 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.996 STDOUT tofu:         } -> (known after apply)
12:35:33.996 STDOUT tofu:       ~ versioning {
12:35:33.996 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.996 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.996 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.996 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.996 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.996 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.997 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.997 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.997 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.997 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.997 STDOUT tofu:           + id                          = (known after apply)
12:35:33.997 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.997 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.997 STDOUT tofu:           + region                      = (known after apply)
12:35:33.997 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.997 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.997 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.997 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.997 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.997 STDOUT tofu:         } -> (known after apply)
12:35:33.997 STDOUT tofu:       ~ website {
12:35:33.997 STDOUT tofu:           + acceleration_status         = (known after apply)
12:35:33.997 STDOUT tofu:           + acl                         = (known after apply)
12:35:33.997 STDOUT tofu:           + arn                         = (known after apply)
12:35:33.997 STDOUT tofu:           + bucket                      = (known after apply)
12:35:33.997 STDOUT tofu:           + bucket_domain_name          = (known after apply)
12:35:33.997 STDOUT tofu:           + bucket_prefix               = (known after apply)
12:35:33.997 STDOUT tofu:           + bucket_region               = (known after apply)
12:35:33.997 STDOUT tofu:           + bucket_regional_domain_name = (known after apply)
12:35:33.997 STDOUT tofu:           + force_destroy               = (known after apply)
12:35:33.997 STDOUT tofu:           + hosted_zone_id              = (known after apply)
12:35:33.998 STDOUT tofu:           + id                          = (known after apply)
12:35:33.998 STDOUT tofu:           + object_lock_enabled         = (known after apply)
12:35:33.998 STDOUT tofu:           + policy                      = (known after apply)
12:35:33.998 STDOUT tofu:           + region                      = (known after apply)
12:35:33.998 STDOUT tofu:           + request_payer               = (known after apply)
12:35:33.998 STDOUT tofu:           + tags                        = (known after apply)
12:35:33.998 STDOUT tofu:           + tags_all                    = (known after apply)
12:35:33.998 STDOUT tofu:           + website_domain              = (known after apply)
12:35:33.998 STDOUT tofu:           + website_endpoint            = (known after apply)
12:35:33.998 STDOUT tofu:         } -> (known after apply)
12:35:33.998 STDOUT tofu:     }
12:35:33.998 STDOUT tofu:   # aws_s3_bucket_public_access_block.this[0] must be replaced
12:35:33.998 STDOUT tofu: -/+ resource "aws_s3_bucket_public_access_block" "this" {
12:35:33.998 STDOUT tofu:       ~ bucket                  = "skillupaws-dev-app-bucket" # forces replacement -> (known after apply) # forces replacement
12:35:33.998 STDOUT tofu:       ~ id                      = "skillupaws-dev-app-bucket" -> (known after apply)
12:35:33.998 STDOUT tofu:         # (5 unchanged attributes hidden)
12:35:33.998 STDOUT tofu:     }
12:35:33.998 STDOUT tofu:   # aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
12:35:33.998 STDOUT tofu: -/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
12:35:33.998 STDOUT tofu:       ~ bucket = "skillupaws-dev-app-bucket" # forces replacement -> (known after apply) # forces replacement
12:35:33.999 STDOUT tofu:       ~ id     = "skillupaws-dev-app-bucket" -> (known after apply)
12:35:33.999 STDOUT tofu:         # (1 unchanged attribute hidden)
12:35:33.999 STDOUT tofu:       - rule {
12:35:34.003 STDOUT tofu:           - blocked_encryption_types = [] -> null
12:35:34.040 STDOUT tofu:           - bucket_key_enabled       = false -> null
12:35:34.040 STDOUT tofu:           - apply_server_side_encryption_by_default {
12:35:34.040 STDOUT tofu:               - sse_algorithm = "AES256" -> null
12:35:34.040 STDOUT tofu:             }
12:35:34.040 STDOUT tofu:         }
12:35:34.040 STDOUT tofu:       + rule {
12:35:34.040 STDOUT tofu:           + blocked_encryption_types = []
12:35:34.040 STDOUT tofu:           + apply_server_side_encryption_by_default {
12:35:34.040 STDOUT tofu:               + sse_algorithm = "AES256"
12:35:34.040 STDOUT tofu:             }
12:35:34.040 STDOUT tofu:         }
12:35:34.040 STDOUT tofu:     }
12:35:34.040 STDOUT tofu:   # aws_s3_bucket_versioning.this[0] must be replaced
12:35:34.040 STDOUT tofu: -/+ resource "aws_s3_bucket_versioning" "this" {
12:35:34.041 STDOUT tofu:       ~ bucket = "skillupaws-dev-app-bucket" # forces replacement -> (known after apply) # forces replacement
12:35:34.041 STDOUT tofu:       ~ id     = "skillupaws-dev-app-bucket" -> (known after apply)
12:35:34.041 STDOUT tofu:         # (1 unchanged attribute hidden)
12:35:34.041 STDOUT tofu:       ~ versioning_configuration {
12:35:34.041 STDOUT tofu:           + mfa_delete = (known after apply)
12:35:34.041 STDOUT tofu:             # (1 unchanged attribute hidden)
12:35:34.041 STDOUT tofu:         }
12:35:34.041 STDOUT tofu:     }
12:35:34.041 STDOUT tofu: Plan: 4 to add, 0 to change, 4 to destroy.
12:35:34.041 STDOUT tofu: Changes to Outputs:
12:35:34.041 STDOUT tofu:   ~ s3_bucket_arn                           = "arn:aws:s3:::skillupaws-dev-app-bucket" -> (known after apply)
12:35:34.041 STDOUT tofu:   ~ s3_bucket_bucket_domain_name            = "skillupaws-dev-app-bucket.s3.amazonaws.com" -> (known after apply)
12:35:34.041 STDOUT tofu:   ~ s3_bucket_bucket_regional_domain_name   = "skillupaws-dev-app-bucket.s3.ap-south-2.amazonaws.com" -> (known after apply)
12:35:34.042 STDOUT tofu:   ~ s3_bucket_hosted_zone_id                = "Z02976202B4EZMXIPMXF7" -> (known after apply)
12:35:34.042 STDOUT tofu:   ~ s3_bucket_id                            = "skillupaws-dev-app-bucket" -> (known after apply)
12:35:34.042 STDOUT tofu: Warning: Deprecated attribute
12:35:34.042 STDOUT tofu:   on main.tf line 584, in data "aws_iam_policy_document" "elb_log_delivery":
12:35:34.042 STDOUT tofu:  584:     for_each = { for k, v in local.elb_service_accounts : k => v if k == data.aws_region.current.name }
12:35:34.042 STDOUT tofu: The attribute "name" is deprecated. Refer to the provider documentation for
12:35:34.042 STDOUT tofu: details.

```
</details>